servicio-emision/Web References/wsSabreCommand/SabreCommandLLS1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xsd1="http://webservices.sabre.com/sabreXML/2003/07" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd2="http://webservices.sabre.com/sabreXML/2003/07" targetNamespace="https://webservices.sabre.com/websvc" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import schemaLocation="SabreCommandLLS1.6.1RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2003/07" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
    </xsd:schema>
  </types>
  <message name="SabreCommandLLSInput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd2:SabreCommandLLSRQ" />
  </message>
  <message name="SabreCommandLLSOutput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd2:SabreCommandLLSRS" />
  </message>
  <portType name="SabreCommandLLSPortType">
    <operation name="SabreCommandLLSRQ">
      <input message="tns:SabreCommandLLSInput" />
      <output message="tns:SabreCommandLLSOutput" />
    </operation>
  </portType>
  <binding name="SabreCommandLLSSoapBinding" type="tns:SabreCommandLLSPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="SabreCommandLLSRQ">
      <soap:operation soapAction="OTA" />
      <input>
        <soap:header message="tns:SabreCommandLLSInput" part="header" use="literal" />
        <soap:header message="tns:SabreCommandLLSInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </input>
      <output>
        <soap:header message="tns:SabreCommandLLSOutput" part="header" use="literal" />
        <soap:header message="tns:SabreCommandLLSOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </output>
    </operation>
  </binding>
  <service name="SabreCommandLLSService">
    <port name="SabreCommandLLSPortType" binding="tns:SabreCommandLLSSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc" />
    </port>
  </service>
</definitions>