.svn/pristine/6d/6d551fdf6e49b64fde8f650d93edc079499dbb40.svn-base

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><ns5:MessageHeader xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05"><ns5:From><ns5:PartyId>99999</ns5:PartyId></ns5:From><ns5:To><ns5:PartyId>123123</ns5:PartyId></ns5:To><ns5:CPAId>B6</ns5:CPAId><ns5:ConversationId>7B88237CCEBEC866FB03379F4549FAE2</ns5:ConversationId><ns5:Service>SabreCommand</ns5:Service><ns5:Action>SabreCommandLLSRQ</ns5:Action><ns5:MessageData><ns5:MessageId>mid:2011-11-25T05:40:15@eb2.com</ns5:MessageId><ns5:Timestamp>2011-11-25T05:40:15</ns5:Timestamp></ns5:MessageData></ns5:MessageHeader><ns11:Security xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05"><ns11:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!-3982908007210520063!1168514!0</ns11:BinarySecurityToken></ns11:Security></soap:Header><soap:Body><ns8:SabreCommandLLSRQ xmlns:ns14="http://www.sabre.com/ns/Ticketing/misc/1.0" xmlns:ns13="http://webservices.sabre.com/sabreXML/2003/07/request" xmlns:ns12="http://www.opentravel.org/OTA/2002/11" xmlns:ns11="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns10="http://services.sabre.com/STL/v01" xmlns:ns9="http://webservices.sabre.com/sabreXML/2003/07/response" xmlns:ns8="http://webservices.sabre.com/sabreXML/2003/07" xmlns:ns7="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://www.w3.org/1999/xlink" xmlns:ns5="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns4="http://www.opentravel.org/OTA/2003/05" Version="2003A.TsabreXML1.6.1"><ns8:Request Output="SCREEN"><ns8:HostCommand>WPRQMUSDP1ADTXS</ns8:HostCommand></ns8:Request></ns8:SabreCommandLLSRQ></soap:Body></soap:Envelope>